
<!-- header -->
```fish
plan -chdir=sample/instance -workspace=dev -var-file=env/dev.tfvars -lock=false
```
<!-- fmt -->

<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
# aws_instance.sample has been deleted
+ aws_instance.sample will be created
```
</details>
<!-- main -->
<details><summary>Plan: 1 to add, 0 to change, 0 to destroy.</br>

###### TF Sample by @rdhar via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/10761919104/job/29841639195) at 2024-09-08T17:46:35Z.
</summary>

```hcl

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # aws_instance.sample has been deleted
  - resource "aws_instance" "sample" {
      - id                                   = "i-014808792d1e06945" -> null
        tags                                 = {
            "Name" = "sample-instance"
        }
        # (31 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_instance.sample will be created
  + resource "aws_instance" "sample" {
      + ami                                  = "ami-09a1c459d70c72b96"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "sample-instance"
        }
      + tags_all                             = {
          + "Environment" = "Development"
          + "Name"        = "sample-instance"
          + "Stack"       = "instance"
          + "Terraform"   = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ sample_instance_id = "i-014808792d1e06945" -> (known after apply)

```
</details>
<!-- footer -->
<!-- tofu.290.-chdir-sample-instance.-workspace-dev.-var-file-env-dev-tfvars.-out-tfplan -->